/*
 * Задача 12: «Посчитать количество нулей»
 *
 * Напишите функцию countZeros(n), принимающую на вход натуральное число n.
 * Возвращать функция должна суммарное количество нулей, содержащихся во всех числах от 1 до n включительно.
 *
*/

function countZeros(n) {
    let counter = 0;
    for (let i = 10; i <= n; i += 1) {
        let nullsCounter = i;

        for (let j = 0; j <= nullsCounter.toString().length; j++) {
            if (nullsCounter % 10 === 0) {
                counter++;
            }
            nullsCounter = Math.floor(nullsCounter / 10);
        }
    }
    return counter;
}

// Протестируйте решение, вызывая функцию с разными аргументами:

console.log(countZeros(20)); // 21 – 21 нулей в числах: 10, 20, 30, 40, 50, 60, 70, 80, 90, 100 110 120 130 140 150 160 170 180 190 200
// 33 - 10 20 30 40 50 60 70 80 90 100 110 120 130 140 150 160 170 180 190 200 210 220 230 240 250 260 270 280 290 300
// 46 - 10 20 30 40 50 60 70 80 90 100 110 120 130 140 150 160 170 180 190 200 210 220 230 240 250 260 270 280 290 300 310 320 330 340 350 360 370 380 390 400 410 420